// Copyright© DWANGO Co.,Ltd. All Rights Reserved.
/*:
 # 基本型
 ## 定数と変数
 
 `var` は変数、 `let` は定数です。
 */



/*:
 > `myConstant` に Int 型を再代入したらどうなるでしょう？
 */

/*:
 ## 型
 Swift には型推論があります。
 */



//: 型を変換するには型を明示して初期化します。



/*:
 > `String(width)` を `width` に変えたらどうなるでしょう？
 */

/*:
 ## 文字列
 文字列は、ダブルクオート (`"`) で囲います。
 */



//:  値を文字列に入れるには `\(値)` とします。



/*:
 ## オプショナル
 `変数名: 型名?` で宣言します。
 */



//: 文字列が整数に変換できる場合



//: 文字列が整数に変換できない場合



/*:
 ## 配列
 */



//: `let` で宣言された配列は要素の変更ができません。



//: 空配列の宣言とコメント



/*:
 ## 暗黙のオプショナルアンラップ
 */



//: [Next](@next)
